Revit 2027 API
Dimension.Above Property
The text shown above the segment's value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Above { get; set; }
Public Property Above As String
	Get
	Set
public:
property String^ Above {
	String^ get ();
	void set (String^ value);
}
member Above : string with get, set
Property Value
String
Remarks
This property is for use with single-segment dimensions only. For multi-segment dimensions use the corresponding properties of the DimensionSegment class.
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace